Revit 2027 API
RenderingSettings.BackgroundStyle Property
 The enum value that controls the background style for rendering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BackgroundStyle BackgroundStyle { get; set; }
Public Property BackgroundStyle As BackgroundStyle
	Get
	Set
public:
property BackgroundStyle BackgroundStyle {
	BackgroundStyle get ();
	void set (BackgroundStyle value);
}
member BackgroundStyle : BackgroundStyle with get, set
Property Value
BackgroundStyle
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RenderingSettings Class
Autodesk.Revit.DB Namespace